# TessellatedShapeBuilder Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder Constructor
TessellatedShapeBuilder Class See Also
---
Constructs a new instance of a TessellatedShapeBuilder.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public TessellatedShapeBuilder()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
TessellatedShapeBuilder()
```

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace